PANDAS BASICS

IMPORTING MODULE

In [1]:
import pandas as pd

LIST Functions

In [2]:
list=[1,2,3,4,5]
list2=pd.Series(list)
print(list2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
list=[1,2,3,4,5]
list2=pd.Series(list)
print(list2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

Giving Path of DATA file

In [4]:
path=r"C:\Users\hp\repositories\Corizo\AI\Pandas_Dataset.csv"

READING THE CSV File

In [5]:
df = pd.read_csv(r"C:\Users\hp\repositories\Corizo\AI\Pandas_Dataset.csv")
df

     CustomerID     Gen   Age  AnnualIncome  Spending Score
0           1.0    Male  19.0          15.0            39.0
1           2.0    Male  21.0          15.0            81.0
2           3.0     NaN   NaN           NaN             6.0
3           4.0  Female  23.0          16.0            77.0
4           5.0  Female  31.0          17.0            40.0
..          ...     ...   ...           ...             ...
195       196.0  Female  35.0         120.0            79.0
196       197.0  Female  45.0         126.0            28.0
197       198.0    Male  32.0         126.0            74.0
198       199.0    Male  32.0         137.0            18.0
199       200.0    Male  30.0         137.0            83.0

[200 rows x 5 columns]

Obtaining Basic Info about DATASET

In [6]:
df.columns # retuns the columns of the dataset

Index(['CustomerID', 'Gen', 'Age', 'AnnualIncome', 'Spending Score'], dtype='object')

In [7]:
len(df) #gives the length of data

200

In [8]:
df.head()

   CustomerID     Gen   Age  AnnualIncome  Spending Score
0         1.0    Male  19.0          15.0            39.0
1         2.0    Male  21.0          15.0            81.0
2         3.0     NaN   NaN           NaN             6.0
3         4.0  Female  23.0          16.0            77.0
4         5.0  Female  31.0          17.0            40.0

In [9]:
df.tail()

     CustomerID     Gen   Age  AnnualIncome  Spending Score
195       196.0  Female  35.0         120.0            79.0
196       197.0  Female  45.0         126.0            28.0
197       198.0    Male  32.0         126.0            74.0
198       199.0    Male  32.0         137.0            18.0
199       200.0    Male  30.0         137.0            83.0